neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32L0.c
void DMA_Clock_Disable()
{
#if defined (DMA1_BASE)
        __HAL_RCC_DMA1_CLK_DISABLE();
#endif //DMA1_BASE
}

hwDMA_OpResult DMA_NVIC_Init(hwDMA_Channel_Index channel_index)
{
        if(channel_index>=hwDMA_Channel_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(DMA_Channel_Init_Status[channel_index]==true)
        {
                return hwDMA_OK;
        }

        switch(channel_index)
        {
#if defined (STM32L010x4) || defined (STM32L011xx) || defined (STM32L021xx)
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);
                        break;
#endif
#if defined (DMA1_Channel2)
                case hwDMA_Channel_Index_2:
#endif
#if defined (DMA1_Channel3)
                case hwDMA_Channel_Index_3:
#endif
                        HAL_NVIC_SetPriority(DMA1_Channel2_3_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel2_3_IRQn);
                        break;
#if defined (DMA1_Channel4)
                case hwDMA_Channel_Index_4:
#endif
#if defined (DMA1_Channel5)
                case hwDMA_Channel_Index_5:
#endif
                        HAL_NVIC_SetPriority(DMA1_Channel4_5_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel4_5_IRQn);
                        break;
#endif
#elif defined (STM32L010x6) || defined (STM32L010x8) || defined (STM32L010xB) || \
      defined (STM32L031xx) || defined (STM32L041xx) || \
      defined (STM32L051xx) || defined (STM32L052xx) || defined (STM32L053xx) || \
      defined (STM32L062xx) || defined (STM32L063xx) || \
      defined (STM32L071xx) || defined (STM32L072xx) || defined (STM32L073xx) || \
      defined (STM32L081xx) || defined (STM32L082xx) || defined (STM32L083xx)
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);
                        break;
#endif
#if defined (DMA1_Channel2)
                case hwDMA_Channel_Index_2:
#endif
#if defined (DMA1_Channel3)
                case hwDMA_Channel_Index_3:
#endif
                        HAL_NVIC_SetPriority(DMA1_Channel2_3_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel2_3_IRQn);
                        break;
#if defined (DMA1_Channel4)
                case hwDMA_Channel_Index_4:
#endif
#if defined (DMA1_Channel5)
                case hwDMA_Channel_Index_5:
#endif
#if defined (DMA1_Channel6)
                case hwDMA_Channel_Index_6:
#endif
#if defined (DMA1_Channel7)
                case hwDMA_Channel_Index_7:
#endif
                        HAL_NVIC_SetPriority(DMA1_Channel4_5_6_7_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel4_5_6_7_IRQn);
                        break;
#endif
#else
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);
                        break;
#endif
#if defined (DMA1_Channel2)
                case hwDMA_Channel_Index_2:
                        HAL_NVIC_SetPriority(DMA1_Channel2_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel2_IRQn);
                        break;
#endif
#if defined (DMA1_Channel3)
                case hwDMA_Channel_Index_3:
                        HAL_NVIC_SetPriority(DMA1_Channel3_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel3_IRQn);
                        break;
#endif
#if defined (DMA1_Channel4)
                case hwDMA_Channel_Index_4:
                        HAL_NVIC_SetPriority(DMA1_Channel4_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel4_IRQn);
                        break;
#endif
#if defined (DMA1_Channel5)
                case hwDMA_Channel_Index_5:
                        HAL_NVIC_SetPriority(DMA1_Channel5_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel5_IRQn);
                        break;
#endif
#if defined (DMA1_Channel6)
                case hwDMA_Channel_Index_6:
                        HAL_NVIC_SetPriority(DMA1_Channel6_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel6_IRQn);
                        break;
#endif
#if defined (DMA1_Channel7)
                case hwDMA_Channel_Index_7:
                        HAL_NVIC_SetPriority(DMA1_Channel7_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel7_IRQn);
                        break;
#endif
#endif //DMA1_BASE
#endif
        }

        DMA_NVIC_Init_Status[channel_index] = true;

        return hwDMA_OK;
}

hwDMA_OpResult DMA_NVIC_DeInit(hwDMA_Channel_Index channel_index)
{
        if(channel_index>=hwDMA_Channel_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        DMA_NVIC_Init_Status[channel_index] = false;

        switch(channel_index)
        {
#if defined (STM32L010x4) || defined (STM32L011xx) || defined (STM32L021xx)
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_DisableIRQ(DMA1_Channel1_IRQn);
                        break;
#endif
#if defined (DMA1_Channel2)
                case hwDMA_Channel_Index_2:
#endif
#if defined (DMA1_Channel3)
                case hwDMA_Channel_Index_3:
#endif
#if defined (DMA1_Channel2) && defined (DMA1_Channel3)
                        if(!DMA_NVIC_Init_Status[hwDMA_Channel_Index_2] && !DMA_NVIC_Init_Status[hwDMA_Channel_Index_3])
#endif
                        {
                                HAL_NVIC_DisableIRQ(DMA1_Channel2_3_IRQn);
                        }
                        break;
#if defined (DMA1_Channel4)
                case hwDMA_Channel_Index_4:
#endif
#if defined (DMA1_Channel5)
                case hwDMA_Channel_Index_5:
#endif
#if defined (DMA1_Channel2) && defined (DMA1_Channel3)
                        if(!DMA_NVIC_Init_Status[hwDMA_Channel_Index_4] && !DMA_NVIC_Init_Status[hwDMA_Channel_Index_5])
#endif
                        {
                                HAL_NVIC_DisableIRQ(DMA1_Channel4_5_IRQn);
                        }
                        break;
#endif
#elif defined (STM32L010x6) || defined (STM32L010x8) || defined (STM32L010xB) || \
      defined (STM32L031xx) || defined (STM32L041xx) || \
      defined (STM32L051xx) || defined (STM32L052xx) || defined (STM32L053xx) || \
      defined (STM32L062xx) || defined (STM32L063xx) || \
      defined (STM32L071xx) || defined (STM32L072xx) || defined (STM32L073xx) || \
      defined (STM32L081xx) || defined (STM32L082xx) || defined (STM32L083xx)
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_DisableIRQ(DMA1_Channel1_IRQn);
                        break;
#endif
#if defined (DMA1_Channel2)
                case hwDMA_Channel_Index_2:
#endif
#if defined (DMA1_Channel3)
                case hwDMA_Channel_Index_3:
#endif
#if defined (DMA1_Channel2) && defined (DMA1_Channel3)
                        if(!DMA_NVIC_Init_Status[hwDMA_Channel_Index_2] && !DMA_NVIC_Init_Status[hwDMA_Channel_Index_3])
#endif
                        {
                                HAL_NVIC_DisableIRQ(DMA1_Channel2_3_IRQn);
                        }
                        break;
#if defined (DMA1_Channel4)
                case hwDMA_Channel_Index_4:
#endif
#if defined (DMA1_Channel5)
                case hwDMA_Channel_Index_5:
#endif
#if defined (DMA1_Channel6)
                case hwDMA_Channel_Index_6:
#endif
#if defined (DMA1_Channel7)
                case hwDMA_Channel_Index_7:
#endif
                        {
                                bool dma1_4_7_used = false;

#if defined (DMA1_Channel4)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_4])
                                {
                                        dma1_4_7_used = true;
                                }
#endif
#if defined (DMA1_Channel5)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_5])
                                {
                                        dma1_4_7_used = true;
                                }
#endif
#if defined (DMA1_Channel6)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_6])
                                {
                                        dma1_4_7_used = true;
                                }
#endif
#if defined (DMA1_Channel7)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_7])
                                {
                                        dma1_4_7_used = true;
                                }
#endif
                                if (!dma1_4_7_used)
                                {
                                        HAL_NVIC_DisableIRQ(DMA1_Channel4_5_6_7_IRQn);
                                }
                        }
                        break;
#endif
#else
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_DisableIRQ(DMA1_Channel1_IRQn);
                        break;
#endif
#if defined (DMA1_Channel2)
                case hwDMA_Channel_Index_2:
                        HAL_NVIC_DisableIRQ(DMA1_Channel2_IRQn);
                        break;
#endif
#if defined (DMA1_Channel3)
                case hwDMA_Channel_Index_3:
                        HAL_NVIC_DisableIRQ(DMA1_Channel3_IRQn);
                        break;
#endif
#if defined (DMA1_Channel4)
                case hwDMA_Channel_Index_4:
                        HAL_NVIC_DisableIRQ(DMA1_Channel4_IRQn);
                        break;
#endif
#if defined (DMA1_Channel5)
                case hwDMA_Channel_Index_5:
                        HAL_NVIC_DisableIRQ(DMA1_Channel5_IRQn);
                        break;
#endif
#if defined (DMA1_Channel6)
                case hwDMA_Channel_Index_6:
                        HAL_NVIC_DisableIRQ(DMA1_Channel6_IRQn);
                        break;
#endif
#if defined (DMA1_Channel7)
                case hwDMA_Channel_Index_7:
                        HAL_NVIC_DisableIRQ(DMA1_Channel7_IRQn);
                        break;
#endif
#endif //DMA1_BASE
#endif
        }

